create database project6;

use project6;

select * from 가장_많이_사용하는_교수_학습_자료;

# 1번 가장_많이_사용하는_교수_학습_자료
select `특성별(3)` as 장애영역별,국가에서_개발하여_보급하는_교과용_도서,교육청이나_공공기관에서_제작하여_보급하는_교수_학습자료,민간업체나_사설단체에서_제공하는_교수_학습자료,시중에서_판매하는_교수_학습자료,자체_개발한_교수_학습자료,기타
from 가장_많이_사용하는_교수_학습_자료
where `특성별(3)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

# 2번 교육과정_운영을_어렵게_하는_사항
select `특성별(3)` as 장애영역별,교사의_교수_학습_방법에_대한_이해_부족,학생의_장애_정도를_고려하지_않은_보호자의_요구,학교_관리자나_동료교사들의_이해_부족과_비협조적인_태도,교육과정_운영에_필요한_예산_인력_등의_부족,장애유형의_다양성_또는_장애_정도의_중증화,기타
from 교육과정_운영을_어렵게_하는_사항
where `특성별(3)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

# 3번 보호자의_특수교육_관련서비스_지원에_대한_만족도
select `특성별(2)` as 장애영역별,매우만족,만족,보통,불만족,매우불만족
from 보호자의_특수교육_관련서비스_지원에_대한_만족도
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

# 4번 특수학교_중학교_및_고등학교의_교과수업_형태
select `특성별(2)`as 장애영역별,담임교사가_주요_교과를_지도하고_일부교과를_교과전담교사가_지도함,모든_교사가_교과별로_나누어_지도함
from 특수학교_중학교_및_고등학교의_교과수업_형태 
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

# 5번 향후_지원이_필요한_특수교육_관련서비스
select `특성별(2)` as 장애영역별,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음
from 향후_지원이_필요한_특수교육_관련서비스
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

# 6번 현재_지원_받고_있는_특수교육_관련서비스_중복응답
select `특성별(2)` as 장애영역별,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음
from 현재_지원_받고_있는_특수교육_관련서비스_중복응답
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';


######################################################################################

# 6번 5번 합쳐보았지만 활용을 못하였습니다...
create table service
	(`특성별(2)` varchar(50),
	상담지원 int,
	가족지원 int,
	치료지원 int,
	보조인력지원 int,
	보조공학기기지원 int,
	학습보조기지원 int,
	통학지원 int,
	정보접근지원 int,
	기타 int,
	없음 int);
		
desc service;

insert into service (`특성별(2)`,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음) 
select `특성별(2)`,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음
from 향후_지원이_필요한_특수교육_관련서비스
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

insert into service (`특성별(2)`,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음) 
select `특성별(2)`,상담지원,가족지원,치료지원,보조인력지원,보조공학기기지원,학습보조기지원,통학지원,정보접근지원,기타,없음
from 현재_지원_받고_있는_특수교육_관련서비스_중복응답
where `특성별(2)` in ('시각장애','청각장애','지적장애','지체장애','정서·행동장애')
and 항목='비율 (%)';

select * from service;
